
/*1.先在创建ufg8编码的retire_spring数据库 2.运行程序，自动在此数据库生成表结构 3.运行initDate脚本，初始化基本数据 */

/*Data for the table `tb_department` */

insert  into `tb_department`(`department_id`,`department_name`) values (0,'无'),(1,'校办'),(2,'组织部'),(3,'人事处'),(4,'宣传统战部'),(5,'纪检监察处'),(6,'工会'),(7,'团委'),(8,'教务处'),(9,'科技处'),(10,'学科处'),(12,'财务处'),(13,'学生处'),(14,'研究生院'),(15,'招生就业处'),(16,'国际交流处'),(17,'国有资产管理处'),(18,'基建处'),(19,'总务处'),(20,'保卫处'),(21,'离退处'),(22,'网络信息中心'),(23,'实验仪器中心'),(24,'图书馆'),(25,'后勤'),(26,'轻工与化学工程'),(27,'生物工程'),(28,'食品学院'),(29,'纺织与材料学院'),(30,'机械工程与自动化'),(31,'信息科学与工程'),(32,'艺术设计学院'),(33,'服装学院'),(34,'管理学院'),(35,'外国语学院'),(36,'国际教育学院'),(37,'继续教育学院'),(38,'思政部'),(39,'体育教学部'),(40,'总公司'),(41,'院办'),(42,'幼儿园'),(43,'印刷厂'),(44,'现代教育技术部'),(45,'卫生所'),(46,'审计'),(47,'社科部'),(48,'设备部'),(49,'劳服'),(50,'金州校区'),(51,'教服中心'),(52,'基础部'),(53,'伙食科'),(54,'高教'),(55,'成教');

/*Data for the table `tb_duty` */

insert  into `tb_duty`(`duty_id`,`duty_name`) values (0,'无'),(1,'教授'),(2,'正高'),(3,'副教授'),(4,'副高'),(5,'讲师'),(6,'中级'),(7,'正处'),(8,'管理五级'),(9,'副处'),(10,'管理六级'),(11,'正科'),(12,'管理七级'),(13,'副科'),(14,'管理八级'),(15,'初级'),(16,'科员'),(17,'工人'),(18,'工人技师'),(19,'高级工程师'),(20,'工程师'),(21,'高级实验师'),(22,'总支书记'),(23,'助研'),(24,'助工'),(25,'处长'),(26,'科长'),(27,'会计师'),(28,'馆员'),(29,'主治医师'),(30,'主管药师'),(31,'主管护师'),(32,'实验师'),(33,'副主任医师'),(34,'副研'),(35,'部长');

/*Data for the table `tb_nation` */

insert  into `tb_nation`(`nation_id`,`nation_name`) values (0,'无'),(1,'汉族'),(2,'壮族'),(3,'满族'),(4,'回族'),(5,'苗族'),(6,'维吾尔族'),(7,'土家族'),(8,'彝族'),(9,'蒙古族'),(10,'藏族'),(11,'布依族'),(12,'侗族'),(13,'瑶族'),(14,'朝鲜族'),(15,'白族'),(16,'哈尼族'),(17,'哈萨克族'),(18,'黎族'),(19,'傣族'),(20,'畲族'),(21,'傈僳族'),(22,'仡佬族'),(23,'东乡族'),(24,'高山族'),(25,'拉祜族'),(26,'水族'),(27,'佤族'),(28,'纳西族'),(29,'羌族'),(30,'土族'),(31,'仫佬族'),(32,'锡伯族'),(33,'柯尔克孜族'),(34,'达斡尔族'),(35,'景颇族'),(36,'毛南族'),(37,'撒拉族'),(38,'布朗族'),(39,'塔吉克族'),(40,'阿昌族'),(41,'普米族'),(42,'鄂温克族'),(43,'怒族'),(44,'京族'),(45,'基诺族'),(46,'德昂族'),(47,'保安族'),(48,'俄罗斯族'),(49,'裕固族'),(50,'乌孜别克族'),(51,'门巴族'),(52,'鄂伦春族'),(53,'独龙族'),(54,'塔塔尔族'),(55,'赫哲族'),(56,'珞巴族');

/*Data for the table `tb_politics` */

insert  into `tb_politics`(`politics_id`,`politics_name`) values (0,'无'),(1,'群众'),(2,'共青团员'),(3,'中共党员'),(4,'民革'),(5,'民进'),(6,'民建'),(7,'民促'),(8,'九三学社');

/*Data for the table `tb_admin` */

insert  into `tb_admin`(`admin_id`,`create_time`,`update_time`,`can_login`,`email`,`img_url`,`job_num`,`last_time`,`name`,`password`,`verify`,`verify_code`,`verify_time`) values (1,NULL,NULL,0,NULL,NULL,'123456','2018-05-16 12:47:47','测试管理员','2a3ffecf3fb098805305a7a0e6d3e680',NULL,NULL,NULL);