
/*1.先在创建ufg8编码的retire-spring数据库 2.运行程序，自动在此数据库生成表结构 3.运行initDate脚本，初始化基本数据 */

/*Data for the table `tb_nation` */

insert  into `tb_nation`(`nation_id`,`nation_name`) values (1,'汉族'),(2,'壮族'),(3,'满族'),(4,'回族'),(5,'苗族'),(6,'维吾尔族'),(7,'土家族'),(8,'彝族'),(9,'蒙古族'),(10,'藏族'),(11,'布依族'),(12,'侗族'),(13,'瑶族'),(14,'朝鲜族'),(15,'白族'),(16,'哈尼族'),(17,'哈萨克族'),(18,'黎族'),(19,'傣族'),(20,'畲族'),(21,'傈僳族'),(22,'仡佬族'),(23,'东乡族'),(24,'高山族'),(25,'拉祜族'),(26,'水族'),(27,'佤族'),(28,'纳西族'),(29,'羌族'),(30,'土族'),(31,'仫佬族'),(32,'锡伯族'),(33,'柯尔克孜族'),(34,'达斡尔族'),(35,'景颇族'),(36,'毛南族'),(37,'撒拉族'),(38,'布朗族'),(39,'塔吉克族'),(40,'阿昌族'),(41,'普米族'),(42,'鄂温克族'),(43,'怒族'),(44,'京族'),(45,'基诺族'),(46,'德昂族'),(47,'保安族'),(48,'俄罗斯族'),(49,'裕固族'),(50,'乌孜别克族'),(51,'门巴族'),(52,'鄂伦春族'),(53,'独龙族'),(54,'塔塔尔族'),(55,'赫哲族'),(56,'珞巴族');

/*Data for the table `tb_duty` */

insert  into `tb_duty`(`duty_id`,`duty_name`) values (1,'教授'),(2,'正高'),(3,'副教授'),(4,'副高'),(5,'讲师'),(6,'中级'),(7,'正处'),(8,'管理五级'),(9,'副处'),(10,'管理六级'),(11,'正科'),(12,'管理七级'),(13,'副科'),(14,'管理八级'),(15,'初级'),(16,'科员'),(17,'工人'),(18,'工人技师'),(19,'高级工程师'),(20,'工程师'),(21,'高级实验师'),(22,'总支书记'),(23,'助研'),(24,'助工'),(25,'处长'),(26,'科长'),(27,'会计师'),(28,'馆员'),(29,'主治医师'),(30,'主管药师'),(31,'主管护师'),(32,'实验师'),(33,'副主任医师'),(34,'副研'),(35,'部长');

/*Data for the table `tb_department` */

insert  into `tb_department`(`department_id`,`department_name`) values (1,'校办'),(2,'组织部'),(3,'人事处'),(4,'宣传统战部'),(5,'纪检监察处'),(6,'工会'),(7,'团委'),(8,'教务处'),(9,'科技处'),(10,'学科处'),(11,'财务处'),(12,'学生处'),(13,'研究生院'),(14,'招生就业处'),(15,'国际交流处'),(16,'国有资产管理处'),(17,'基建处'),(18,'总务处'),(19,'保卫处'),(20,'离退处'),(21,'网络信息中心'),(22,'实验仪器中心'),(23,'图书馆'),(24,'后勤'),(25,'轻工与化学工程'),(26,'生物工程'),(27,'食品学院'),(28,'纺织与材料学院'),(29,'机械工程与自动化'),(30,'信息科学与工程'),(31,'艺术设计学院'),(32,'服装学院'),(33,'管理学院'),(34,'外国语学院'),(35,'国际教育学院'),(36,'继续教育学院'),(37,'思政部'),(38,'体育教学部'),(39,'总公司'),(40,'院办'),(41,'幼儿园'),(42,'印刷厂'),(43,'现代教育技术部'),(44,'卫生所'),(45,'审计'),(46,'社科部'),(47,'设备部'),(48,'劳服'),(49,'金州校区'),(50,'教服中心'),(51,'基础部'),(52,'伙食科'),(53,'高教'),(54,'成教');

/*Data for the table `tb_politics` */

insert  into `tb_politics`(`politics_id`,`politics_name`) values (1,'群众'),(2,'共青团员'),(3,'中共党员');

/*Data for the table `tb_admin` */

insert  into `tb_admin`(`admin_id`,`create_time`,`update_time`,`can_login`,`email`,`img_url`,`job_num`,`last_time`,`name`,`password`,`verify`,`verify_code`,`verify_time`) values (1,NULL,NULL,0,NULL,NULL,'123456','2018-05-16 12:47:47','测试管理员','2a3ffecf3fb098805305a7a0e6d3e680',NULL,NULL,NULL);